Revit 2024 API
View3D.IsPerspective Property
 Identifies whether this is a perspective view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsPerspective { get; }
Visual Basic
Public ReadOnly Property IsPerspective As Boolean
	Get
Visual C++
public:
property bool IsPerspective {
	bool get ();
}
Remarks
 In a perspective view, view direction is variable - it is the direction that connects a particular point on the model with the eye position. The property ViewDirection becomes less meaningful - it only describes the general orientation of the camera.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Returns true if the view is not a view template.
See Also
View3D Class
Autodesk.Revit.DB Namespace